app/views/welcome/home.html.erb

SELECT "users".* FROM "users"
---
          <%= hidden_field_tag 'active_user', @current_user_id %>
          <%= select_tag("selected_user", options_from_collection_for_select(@online_users.collect, "id", "username")) %>