app/controllers/player_profiles_controller.rb

  def index
    @player_profiles = PlayerProfile.all
---
SELECT "player_profiles".* FROM "player_profiles"