app/controllers/welcome_controller.rb

  def start_game
    #Retrieve player_1 and player_2 id's from post params

    player_1_id = params[:active_user]
    player_2_id = params[:selected_user]

    @player_1 = User.find(player_1_id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

  def home
    #base welcome page
    @users        = User.all
    @online_users = []
    if (current_user != nil)
      @current_user_email = current_user['email']
      @current_user_id = current_user['id']

      @users.each do |user|
        @online_now = user['updated_at'] > 10.minutes.ago
        @user_name  = user['email']
        if (@user_name != @current_user_email)
          @online_users.push(user)
---
SELECT "users".* FROM "users"
UPDATE "users" SET "updated_at" = '2014-11-30 07:45:35.123194' WHERE "users"."id" = 2