app/views/layouts/_leaderboard.html.erb

SELECT "users".* FROM "users"
---
       <div class="panel-body">
       <% @users = User.all %>